# Приветствие
MESSAGE_FIRST = "🚀Привет! Ты, похоже, здесь впервые, верно? " \
                "Прежде, чем я начну тебе помогать, давай познакомимся!️"
# Все сообщения, связанные с профилем
MESSAGE_PROFILE_CHANGE = "Хочешь изменить свой профиль? Хорошо, я помогу тебе с этим!"
MESSAGE_PROFILE_SUCCESS = "Отлично! Твой профиль обновлен! 🌟"
MESSAGE_CITY = "🏡Выбери из списка свой город или напиши его название одной строкой и нажми 'Отправить'"
MESSAGE_GENDER = "В каком роде я могу к тебе обращаться?"
MESSAGE_NAME = "Хорошо. Теперь напиши свое имя и фамилию в одну строку и нажми 'Отправить'\n\nПример: Сергей Орлов\n\n"
MESSAGE_INTEREST = "📌Напиши, о чем тебе было бы интересно поговорить, чем ты хочешь поделиться с другими  людьми?\n\n" \
                   "🍎Это может быть что угодно, от цивилистики до домашнего огорода\n\n" \
                   "🕵🏼‍♂️Или ты можешь стать человеком-загадкой и пропустить этот вопрос"
# Сообщения по поиску собеседника
MESSAGE_SEARCH_NOT = "Хорошо, я напишу тебе через неделю, если захочешь поискать собеседников!\n\nНо если ты " \
                 "передумаешь раньше, то просто введи команду /start, и я найду тебе собеседника!"
MESSAGE_SEARCH_OK = "Здорово 🙌🏼 \n\nЯ буду искать тебе собеседника, и как только найду, сразу познакомлю вас!👫"
MESSAGE_SEARCH_ASK = "Ты участвовуешь в подборе собеседников на этой неделе?"

MESSAGE_QUEST_YES = "Это здорово! Надеюсь, тебе понравилась встреча.\nОцени то, как все прошло!"
MESSAGE_QUEST_PLAN = "Понимаю, иногда очень сложно найти время. Я напишу тебе еще через некоторое время, чтобы" \
                     " поинтересоваться вашей встречей!"
MESSAGE_QUEST_NO = "Мне очень жаль, что встерча не состоялась."
MESSAGE_ALREADY_POOLING = "Кажется, ты уже участвуешь в поиске. Прошу тебя, подожди немного, пока я " \
                          "подберу тебе собеседника и вы сможете с поговорить."
MESSAGE_ALREADY_IN_PAIR = "Похоже, я уже нашел тебе собеседника. Подожди до следующей недели для следующего поиска " \
                          "собеседника!"